Repository: 84000/data-translation-memory
Catalog: toh188-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Mahāyāna Sūtra The Prophecy of Dīpaṅkara Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One was dwelling in Śrāvastī, in Jeta’s Grove, Anāthapiṇḍada’s Park, together with a great saṅgha of 1,250 monks.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: At that time, the Blessed One, surrounded and attended by a retinue of many hundreds of thousands, was teaching the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བ་ལ་སོ་སོར་བརྟག་པ་ཉིད་ཀྱིས་བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One said to the venerable Ānanda, “Ānanda, you must make your motivation very pure by examining each root of virtue.

source: ཀུན་དགའ་བོ་ངས་སངས་རྒྱས་བརྒྱ་སྟོང་མང་པོ་ལ་ཞེ་ས་དང་བཅས་པས་བསྙེན་བཀུར་བྱས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ང་སྔར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་གྱི། གང་གི་ཚེ་ངས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་མཐོང་ནས་ཨུད་པལ་ལྔ་ཕུལ་བ་དེའི་འོག་ཏུ་ང་ཆོས་བདག་མེད་པ་ཉིད་ལ་མོས་པར་གྱུར་ཅིང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་ཕྱིར་རོ། །
en: If you ask why, Ānanda, though I respectfully venerated hundreds of thousands of buddhas, those blessed buddhas did not prophesy that I would achieve unsurpassed complete and perfect awakening, but after I saw the Thus-Gone Dīpaṅkara and offered him five utpala flowers, I developed confidence in the selflessness of phenomena and gained the acceptance that phenomena are unarisen.

source: ཀུན་དགའ་བོ་དེ་བས་ན་ཁྱོད་དགེ་བའི་རྩ་བས་ཆོག་ཤེས་པར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: That is why, Ānanda, you should not be content with your roots of virtue.

source: ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ཡངས་པ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་འཛམ་བུའི་གླིང་འདིར་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཞེས་བྱ་བ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ། རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: “If you ask why, Ānanda, in the past, long ago—an uncountable, exceedingly uncountable, vast, immeasurable, and inconceivable number of eons ago—at that time, on that occasion, here in Jambudvīpa, there was a king known as Ajātaśatru, who was shapely, handsome, pleasant to behold, and provided with a supremely rich and fine complexion.

source: ཀུན་དགའ་བོ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དེ་ལ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དེ་ཐམས་ཅད་ཀྱང་བཀྲ་བ། བལྟ་ན་སྡུག་པ། སྐྱེད་མོས་ཚལ་ཕུན་སུམ་ཚོགས་པ། རྫིང་བུ་ཕུན་སུམ་ཚོགས་པ། མེ་ཏོག་ཕུན་སུམ་ཚོགས་པ། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ། བདེ་བ་ལོ་ལེགས་པ། ཉམས་དགའ་བ།
en: “Ānanda, that king, Ajātaśatru, had eighty-four thousand cities, every one of them dazzling and pleasant to behold, with magnificent gardens, magnificent ponds, magnificent flowers, magnificent fruits, delightful good harvests, and a joyful atmosphere.

source: འབྱོར་པ། རྒྱས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་ཤ་སྟག་གོ། །
en: They were wealthy, prosperous, and filled with a great multitude of people.

source: ཀུན་དགའ་བོ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དེ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དེ་དེ་ན་གནས་སོ། །
en: “Ānanda, that king, Ajātaśatru, had a royal palace known as Padmāvatī, and there the king, Ajātaśatru, resided.

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་མདུན་ན་འདོན་བྲམ་ཟེ་གླིང་ལྡན་ཞེས་བྱ་བ་སྙིང་དུ་སྡུག་ཅིང་མཐོང་ན་མི་འཐུན་པ་མེད་པ་དང་ལྡན་པ་ཞིག་ཡོད་དོ། །
en: Now, there was a royal priest of King Ajātaśatru, the brahmin known as Endowed with Islands, who was dear to the king’s heart and never a disagreeable sight.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་རིགས་བཞིའི་མི་ཐམས་ཅད་བསྡུས་ནས་བྲམ་ཟེ་གླིང་ལྡན་བཀུག་སྟེ།
en: At that time, Ānanda, Ajātaśatru gathered all the people of the four castes and summoned the brahmin Endowed with Islands.

source: ཅོད་པན་བཅིངས་ནས་རྒྱལ་སྲིད་ཕྱེད་བྱིན་ཏེ་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །བྲམ་ཟེ་ཁྱོད་རང་གི་ཡུལ་དུ་སོང་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་བྱོས་ལ་མིང་ཡང་པད་མ་ཅན་དུ་ཐོགས་ཤིག །
en: Having tied a crown upon his head, he then gave him half his kingdom and proclaimed, ‘Brahmin, you must return to your country and build a royal palace, which you should also name Padmāvatī.’

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱིས་རང་གི་ཡུལ་དུ་རྒྱལ་པོའི་ཕོ་བྲང་བྱས་ཏེ། མིང་ཡང་པད་མ་ཅན་དུ་བཏགས་སོ། །
en: “Then, Ānanda, King Endowed with Islands built a royal palace in his country, and he also named it Padmāvatī.

source: ཀུན་དགའ་བོ་དེ་ལྟར་དེའི་ཚེ་དེའི་དུས་ན་འཛམ་བུའི་གླིང་འདི་ན་རྒྱལ་པོ་གཉིས་རྒྱལ་སྲིད་བྱེད་དེ།
en: Thus, Ānanda, at that time, on that occasion, here in Jambudvīpa there ruled two kings.

source: གཅིག་ནི་མ་སྐྱེས་དགྲའོ། །ཅིག་ཤོས་ནི་གླིང་ལྡན་ནོ། །
en: One was Ajātaśatru, and the other was Endowed with Islands.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་བཙུན་མོ་དམ་པ་ཁང་བཟངས་ཀྱི་ཡང་ཐོག་ན་བདེ་བར་ཉལ་ཞིང་འདུག་གོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མར་མེ་མཛད་དགའ་ལྡན་གྱི་གནས་ནས་ཤི་འཕོས་ནས་གླང་པོ་ཆེའི་ཕྲུ་གུ་ཐལ་ཀར་དུ་བསྒྱུར་ཏེ།
en: “Then, Ānanda, when Endowed with Islands’ principal queen was sleeping blissfully at the top of the palace, the bodhisattva Dīpaṅkara passed away and transmigrated from Tuṣita Heaven, transforming into a white elephant calf.

source: འོད་ཟེར་རབ་ཏུ་འགྱེད་ཅིང་མའི་གློ་གཡས་པར་ཞུགས་པར་གྱུར་ཏོ། །
en: He emanated light rays and entered his mother’s right side.

source: དེ་ནས་དེའི་ཚེ་བཙུན་མོ་དམ་པ་དེས་རྒྱལ་པོ་གླིང་ལྡན་ལ་སྐབས་འདིར་སྨྲས་སོ། །
en: At that time, the principal queen related this event to King Endowed with Islands.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱིས་བྲམ་ཟེ་མཚན་མཁན་དང་། ལྟས་མཁན་དང་། མཆོད་སྦྱིན་མཁན་རྣམས་བསྡུས་ཏེ་རྨི་ལམ་གྱི་སྐབས་འདི་བསྙད་པ་དང་།
en: “Then, Ānanda, King Endowed with Islands gathered brahmins who were skilled in interpreting omens, those skilled in divination, and those skilled in making offerings, and he related to them the events of this dream.

source: བྲམ་ཟེ་མཚན་མཁན་རྣམས་ཀྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དེ།
en: A brahmin who was skilled in interpreting omens said, ‘O great king, you have gained a great boon!

source: ཁྱོད་ཀྱི་སྲས་སེམས་ཅན་རིན་པོ་ཆེ་ཞིག་བལྟམ་པར་འགྱུར་རོ། །
en: A son of yours, a precious being, is to be born.’

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་རྨི་ལམ་བསྟན་པ་འདི་ཐོས་ནས་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: “Then, Ānanda, when King Endowed with Islands heard this dream prophecy, he was transported with satisfaction and delight, and in his great joy he was elated and cheered.

source: རྒྱལ་པོ་གླིང་ལྡན་དེའི་རྒྱལ་ཁམས་སུ་གཏོགས་པ་ཐམས་ཅད་ལ་སྦྱིན་པ་བྱིན་ཏེ། འདི་ལྟ་སྟེ། ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས། སྐོམ་འདོད་པ་རྣམས་ལ་ནི་སྐོམ། བཞོན་པ་འདོད་པ་རྣམས་ལ་ནི་བཞོན་པ།
en: King Endowed with Islands gave gifts to everyone within the bounds of his kingdom: for those who desired food there was food, for those who desired drinks there were drinks, and for those who desired a vehicle there was a vehicle.

source: སྤོས་དང་། ཕྲེང་བ་རྒྱུ་དང་། བྱུག་པ་དང་། གནས་མལ་རུང་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། གང་ཅི་དང་ཅི་འདོད་པ་ཐམས་ཅད་བྱིན་ནོ། །
en: He gave what was suitable and not unwholesome—incense, garlands, ointments, and bedding—and he gave anything, whatever was desired.

source: ཀུན་དགའ་བོ་དེ་ནས་ཟླ་བ་བཅུ་འདས་པ་དང་། རྒྱལ་པོ་གླིང་ལྡན་གྱི་བུ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བཙས་ཏེ།
en: “Then, Ānanda, ten months passed and the son of King Endowed with Islands was born—shapely, handsome, pleasant to behold, and provided with a supremely rich and fine complexion.

source: བཙས་མ་ཐག་ཏུ་ལུས་ལས་འདི་ལྟ་བུའི་འོད་བྱུང་སྟེ། འོད་དེས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་གྱུར་ཏོ། །
en: As soon as he was born, there emerged from his body a light such as this: by that light, the whole of the royal palace of King Endowed with Islands was illuminated.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རང་གི་གནས་ནས་མི་སྣང་བར་གྱུར་ནས། གཞོན་ནུ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་གཞོན་ནུ་དེ་ལ་ཤིས་པར་བརྗོད་པ་བྱས་ཏེ།
en: Then, at that time, Śakra, the lord of the gods, vanished from his own abode and went to where the child was.

source: འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །འདི་བཙས་མ་ཐག་ཏུ་ལུས་ལས་འདི་ལྟ་བུའི་འོད་བྱུང་སྟེ། འོད་དེས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་གྱུར་པས་གཞོན་ནུའི་མིང་མར་མེ་མཛད་དུ་བཏགས་སོ། །
en: There, he spoke benedictions to that child, and he said, ‘As soon as he was born, there emerged from his body a light such as this: by that light, the whole of the royal palace of King Endowed with Islands was illuminated.

source: དེ་ནས་གཞོན་ནུའི་མིང་མར་མེ་མཛད་མར་མེ་མཛད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: Because of that, the child should be named Dīpaṅkara.’ Then the child was named Dīpaṅkara.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ནས། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: “Then, Ānanda, King Endowed with Islands was transported with satisfaction and delight, and in his great joy he was elated and cheered.

source: ཡང་དེའི་རྒྱལ་ཁམས་སུ་གཏོགས་པ་ཐམས་ཅད་ལ་སྦྱིན་པ་བྱིན་ཏེ། འདི་ལྟ་སྟེ། ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས། སྐོམ་འདོད་པ་རྣམས་ལ་ནི་སྐོམ། བཞོན་པ་འདོད་པ་རྣམས་ལ་ནི་བཞོན་པ།
en: Again, he gave gifts to everyone within the bounds of his kingdom: for those who desired food there was food, for those who desired drinks there were drinks, and for those who desired a vehicle there was a vehicle.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱིས་རྒྱལ་བུ་གཞོན་ནུ་མར་མེ་མཛད་བཀུག་སྟེ།
en: “Later, Ānanda, King Endowed with Islands summoned Prince Dīpaṅkara.

source: ཅོད་པན་བཅིངས་ནས་རྒྱལ་སྲིད་ཕྱེད་བྱིན་ཏེ། འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །གཞོན་ནུ་ཁྱོད་སོང་ལ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་ཅིང་རྩེས་ཤིག །
en: Having tied a crown upon his head, he gave him half the kingdom and proclaimed, ‘Youth, you must go and stay among the queen’s retinue and play.

source: དགའ་བར་གྱིས་ཤིག །དགའ་དགུར་སྤྱོད་ཅིག །
en: Be happy and enjoy yourself!’

source: ཀུན་དགའ་བོ་དེ་ནས་རེ་ཞིག་ན་རྒྱལ་བུ་གཞོན་ནུ་མར་མེ་མཛད་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་སོང་ནས་བཞོན་པ་ཆེན་པོ་ལ་ཞོན་ཏེ།
en: “Shortly thereafter, Ānanda, Prince Dīpaṅkara went among the queen’s retinue and mounted a great carriage.

source: བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་སོང་བ་དང་།
en: Surrounded by a host of ladies, he went to the garden.

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དག་གཅིག་གིས་བདག་ཅག་ཉིད་རྒས་ཤིང་འཁོགས་པ་དང་། ནད་ཀྱིས་བཏབ་པ་དང་། ཤི་བ་ཡང་བསྟན་ཏེ་དགེ་སྦྱོང་ཞིག་ཀྱང་དེར་བཞག་པ་དང་།
en: One of the gods of the Śuddhāvāsa realm displayed people like us—one old and feeble, one struck by illness, and one who was dead—and he also set a mendicant among them.

source: རྒྱལ་བུ་གཞོན་ནུ་མར་མེ་མཛད་ཀྱིས་མཐོང་ནས་ཁ་ལོ་སྒྱུར་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་ཁ་ལོ་སྒྱུར་བ་རྣམ་པ་སྣ་ཚོགས་སྣང་བ་འདི་དག་ཅི་ཡིན།
en: Prince Dīpaṅkara, having seen this, asked the charioteer, ‘Hey, charioteer, what are these various sights?’

source: ཁ་ལོ་སྒྱུར་བས་སྨྲས་པ། གཞོན་ནུ་འདི་དག་ནི་རྒས་པ་ཞེས་བགྱི་བ་དང་། ན་བ་ཞེས་བགྱི་བ་དང་། ཤི་བ་ཞེས་བགྱི་བ་ལགས་ཏེ།
en: “The charioteer replied, ‘Youth, these are so-called aging, illness, and death.

source: གཞོན་ནུ་ཇི་སྲིད་དུ་ཆོས་ཉིད་གདགས་པ་མཆིས་པ་དེ་སྲིད་དུ་རྒ་བ་དང་། ན་བ་དང་།
en: Youth, as long as there are imputations placed upon the true nature, there will be the phenomena of aging, illness, and death.

source: འཆི་བའི་ཆོས་རྣམས་མཆིས་ཏེ་གཞོན་ནུ་ཁྱོད་དང་འོ་སྐོལ་ཡང་དེ་ལྟ་བུ་ལགས་ཏེ།
en: Youth, it is the same for you and the rest of us, for we are merely the residents of saṃsāra.’

source: འཁོར་བ་ན་གནས་པ་ཁོ་ན་ལགས་སོ། །གཞོན་ནུས་སྨྲས་པ། ཁ་ལོ་སྒྱུར་བ་མགོ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་གྱོན་ལ་ཞི་ཞིང་ཉེ་བར་ཞི་བ་གཉའ་ཤིང་གང་ཙམ་དུ་བལྟ་བ་འདི་སུ་ཞིག །
en: “The youth asked, ‘Charioteer, who is this one whose head is shaven, who has donned maroon robes, and who is pacified and gazes the mere length of a yoke?’

source: ཁ་ལོ་སྒྱུར་བས་སྨྲས་པ། གཞོན་ནུ་འདི་ནི་དགེ་སློང་སྟེ།
en: “ ‘Youth, this is a monk,’ said the charioteer.

source: སྡིག་པ་ཐམས་ཅད་སྤངས་པ་ཐར་པ་ལ་མངོན་པར་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བ་ལགས་སོ། །
en: ‘Having relinquished all sin and developed the sense of delight in regard to liberation, he went forth into homelessness.’

source: གཞོན་ནུས་སྨྲས་པ། ཁ་ལོ་སྒྱུར་བ་ལེགས་སོ་ལེགས་སོ། །
en: “The boy replied, ‘Very good, charioteer!

source: དགེ་སློང་འདིའི་ལམ་འདི་ནི་འདོད་པ་ཡིན་ནོ་ཞེས་ནས་ཕྱིར་ལོག་སྟེ་ཁྱིམ་དུ་སོང་ངོ་། །
en: The path of this monk is to be desired,’ and then he turned around and went home.

source: ཀུན་དགའ་བོ་དེ་ནས་རེ་ཞིག་ན་རྒྱལ་བུ་གཞོན་ནུ་མར་མེ་མཛད་ཡང་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་སོང་ངོ་། །
en: “Then, Ānanda, right away, Prince Dīpaṅkara went again to the garden.

source: དེ་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་ཕྱིན་པ་དང་། དེ་ན་སངས་རྒྱས་བརྒྱ་སྟོང་མང་པོས་བསྟན་པའི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་ངོ་། །
en: In the garden he saw the seat of awakening, which had supported many hundreds of thousands of buddhas.

source: ཀུན་དགའ་བོ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མར་མེ་མཛད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེ་མཐོང་ནས་སྐྱེས་པ་དང་བུད་མེད་ཀྱི་ཚོགས་ཐམས་ཅད་ཧ་ཅང་ཐག་མི་རིང་བར་བོར་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Then, Ānanda, the bodhisattva Dīpaṅkara, having seen that seat of awakening, left behind the entire assembly of men and women a short distance and proceeded in the direction of the seat of awakening.

source: དེས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་བ་དང་། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེར་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ། །
en: He saw the seat of awakening and circumambulated it three times, and then at the seat of awakening he sat down with his legs crossed.

source: བྱང་ཆུབ་སེམས་དཔའ་མར་མེ་མཛད་འདུག་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་དེ་ཉིད་ཀྱི་མཚན་མོའི་སྐྱ་རེངས་དང་པོ་ཤར་བའི་དུས་ན་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: As soon as the bodhisattva Dīpaṅkara took his seat, at that moment, at the first break of dawn, he reached unsurpassed complete and perfect awakening, the highest perfect buddhahood.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་མ་ཐག་ཏུ་དེའི་ཚེ་སྐུ་ལས་འདི་ལྟ་བུའི་འོད་བྱུང་སྟེ། འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་གྱུར་ཏོ། །
en: “Ānanda, as soon as the Thus-Gone Dīpaṅkara reached unsurpassed complete and perfect awakening, the highest perfect buddhahood, there emerged from his body a light such as this: by that light the entire trichiliocosm was illuminated.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རང་གི་གནས་ནས་མི་སྣང་བར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then, at that time, Śakra, the lord of the gods, vanished from his own abode and went to where the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara was.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་སྒྲ་འདི་སྐད་ཅེས་ཀྱང་བསྒྲགས་སོ། །
en: There he bowed his head at the feet of the Blessed One and, having made offerings to the Blessed One, he proclaimed these words: ‘Ah!

source: ཀྱེ་མའོ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་འདི་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: The Thus-Gone Dīpaṅkara has emerged in the world!

source: འདི་ལྟར་དེའི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་མཛད་དོ། །
en: Thus, by that light are all the world realms illuminated.’

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལོ་ལྔ་བཅུའི་བར་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེ་ན་བཞུགས་ཀྱང་ཐ་ན་སེམས་ཅན་གཅིག་ཙམ་ཡང་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཉེ་བར་མི་འགྲོའོ། །
en: “The Thus-Gone Dīpaṅkara remained at the seat of awakening for fifty years, and not a single being approached to see him, pay homage to him, or serve him.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་གི་འཁོར་གྱི་མི་རྣམས་བདེ་བ་དང་ལྡན་པའི་ཕྱིར་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཉེ་བར་མི་འགྲོའོ། །
en: If you ask why, because the residents of the royal city of King Endowed with Islands were happy, they did not approach to see him, pay homage to him, or serve him.

source: ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་འདི་སྙམ་དུ་དགོངས་ཏེ། རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་བདེ་བ་དང་ལྡན་པས་ཧ་ཅང་བག་མེད་པར་གྱུར་གྱི།
en: “Then, Ānanda, the Thus-Gone Dīpaṅkara thought, ‘These residents of the royal city of King Endowed with Islands, because they are happy, have become exceedingly careless.

source: ངས་དེ་རྣམས་ཅུང་ཞིག་ཡིད་བྱུང་བར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Surely I should cause them a little distress.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་དེའི་ཚེ་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། རྫུ་འཕྲུལ་ཇི་ལྟ་བུ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་ཀྱི་ནང་དུ་བཻ་དཱུརྱ་ལས་བྱས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་བལྟ་ན་སྡུག་པ།
en: “Then, at that time, the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara manifested a display of miraculous power such that through the manifestation of the display of miraculous power, among the residents of the royal city of King Endowed with Islands, he emanated a great city made of beryl that was pleasant to behold and filled with a great multitude of people.

source: སྐྱེ་བོ་དང་མི་མང་པོས་གང་ལ། མི་དེ་དག་ཀྱང་ལྷག་པར་མཛེས་པ། ལྷག་པར་བལྟ་ན་སྡུག་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དག་ཅིག་མངོན་པར་སྤྲུལ་ཏོ། །
en: Those people, moreover, were more beautiful, more pleasant to behold, and adorned with all types of ornaments.

source: དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་བཻ་དཱུརྱ་ལས་བྱས་པའི་གྲོང་ཁྱེར་ན་གནས་པའི་མི་རྣམས་ཀྱིས་སྤ་གོང་བར་ནི་གྱུར་ན་གང་ཡང་སྐྱོ་བར་ནི་མ་གྱུར་ཏོ། །
en: However, the residents of the royal city of King Endowed with Islands, although they were troubled by the people dwelling in the city made of beryl, were not in the least bit discouraged.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་འདི་སྙམ་དུ་དགོངས་ཏེ། རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་ཧ་ཅང་བག་མེད་པ་དང་ལྡན་པར་གྱུར་པས་ངས་ཡང་ཅུང་ཞིག་སྐྱོ་བ་བསྐྱེད་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: “The blessed, thus-gone, worthy, complete and perfect Buddha Dīpaṅkara thought, ‘Since the residents of the royal city of King Endowed with Islands have become exceedingly careless, surely I should also generate in them a little discouragement.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་ཡང་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། རྫུ་འཕྲུལ་ཇི་ལྟ་བུ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་བཻ་དཱུརྱ་ལས་བྱས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ལ་མེ་ཆེན་པོ་འབར་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: “Then the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara again manifested a display of miraculous power such that through the manifestation of the display of miraculous power he took control of that great city of beryl so that it would blaze with a great fire.

source: བྱིན་གྱིས་བརླབས་མ་ཐག་ཏུ་དེ་ལ་མེ་འབར་བར་གྱུར་ཏོ། །
en: As soon as he took control of it, it caught fire.

source: དེ་ནས་དེའི་ཚེ་སེམས་ཅན་དེ་དག་དང་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ཡང་ཡོངས་སུ་ཟད་ཅིང་མཐར་ཐུག་པ་དང་ཞིག་པར་གྱུར་ནས་སེམས་ཅན་དེ་དག་ཀྱང་ཚུལ་མ་ཡིན་པ་མཐོང་བས་སྡུག་བསྔལ་བར་གྱུར་ཏོ། །
en: Then, at that time, those beings and that great city were destroyed, came to an end, and disappeared. Having seen this unpleasant sight, those beings were distressed.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་རྣམས་ཀྱིས་བཻ་དཱུརྱ་ལས་བྱས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་རྒུད་པར་མཐོང་ནས་དངངས་སྐྲག་པར་གྱུར་ཅིང་སྐྱོ་བར་གྱུར་ནས་སྤུ་ཟིང་ཞེས་བྱེད་དེ། དེ་དག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །
en: “Then, Ānanda, the residents of the royal city of King Endowed with Islands, having seen the fall of the beryl city, were frightened and discouraged such that their hair stood on end.

source: གང་གི་ཕྱིར་གྲོང་ཁྱེར་དེ་ཡོངས་སུ་ཟད་ཅིང་མཐར་ཐུག་པ་དང་ཞིག་པར་གྱུར་པ་ལས་ན་རིང་པོ་མི་ཐོགས་པར་བདག་ཅག་ཀྱང་དེ་ལྟ་བུའི་མི་རྟག་པའི་གནས་སྐབས་སུ་གྱུར་ན་སུ་ཞིག་བདག་ཅག་གི་སྐྱབས་སུ་འགྱུར་སྙམ་མོ། །
en: They thought, ‘If there is a reason that that city was destroyed, came to an end, and disappeared, it will not be long before we, too, encounter the circumstances of impermanence in this way. Who will protect us?’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་འདི་སྙམ་དུ་དགོངས་ཏེ། རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་འདི་རྣམས་ཡོངས་སུ་སྨིན་པས་ངས་ཆོས་བསྟན་པ་ཀུན་ཤེས་པར་ནུས་ཤིང་སྐལ་བ་དང་ལྡན་པ་དང་མཐུ་ཡོད་པར་གྱུར་ཏོ་སྙམ་མོ། །
en: “The thus-gone, worthy, complete and perfect Buddha Dīpaṅkara then thought, ‘Since these residents of the royal city of King Endowed with Islands have been matured, they are able to understand the Dharma taught by me, they have become worthy of it, and they have developed the competence for it.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་མི་དེ་རྣམས་ཀྱི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དེའི་ཚེ་དྲན་པ་དང་ཤེས་བཞིན་གྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེ་ལས་བཞེངས་ཏེ།
en: “At that moment the Thus-Gone Dīpaṅkara, knowing the thoughts of those people, rose from the seat of awakening with mindfulness and alertness.

source: ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: He then set out for the palace of King Endowed with Islands, together with Śakra, the lord of the gods, as his śramaṇa attendant.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་བྱོན་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ཆོས་བསྟན་པ་དང་པོའི་ཚེ་སྲོག་ཆགས་ཉི་ཁྲི་རབ་ཏུ་ཕྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: “Ānanda, as soon as the Thus-Gone Dīpaṅkara arrived, then, at that time, on the occasion of the first Dharma teaching of the Thus-Gone Dīpaṅkara, twenty thousand beings went forth, and all their minds were liberated from defilements without further appropriation.

source: ཆོས་བསྟན་པ་གཉིས་པའི་ཚེ་སྲོག་ཆགས་སུམ་ཁྲི་རབ་ཏུ་ཕྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: At the time of the second Dharma teaching, thirty thousand beings went forth, and all their minds were liberated from defilements without further appropriation.

source: ཆོས་བསྟན་པ་གསུམ་པའི་ཚེ་སྲོག་ཆགས་བཞི་ཁྲི་རབ་ཏུ་ཕྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: At the time of the third Dharma teaching, forty thousand beings went forth, and for all of them the eye of Dharma was purified so that it became stainless and free of blemishes with regard to phenomena.

source: ཆོས་བསྟན་པ་བཞི་པའི་ཚེ་སྲོག་ཆགས་ལྔ་ཁྲི་བར་ཏུ་ཕྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་ལེན་པ་མེད་པ་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: At the time of the fourth Dharma teaching, fifty thousand beings went forth, and all their minds were liberated from defilements without further appropriation.

source: ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དགེ་སློང་གི་དགེ་འདུན་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: “Ānanda, the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara, surrounded and attended by a large saṅgha of monks, taught the Dharma.

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་བུ་ཞིག་སྐྱེས་ནས་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཐོས་ནས་དེ་ལ་ཕོ་ཉ་བཏང་སྟེ། འདི་ལྟར་བདག་ཀྱང་མཆོད་པར་འཚལ་ན་བདག་གི་ཐད་དུ་གཤེགས་པར་གསོལ་ཞེས་སྤྲིང་ངོ་། །
en: “Then, Ānanda, when King Ajātaśatru heard that a son of King Endowed with Islands was born and had reached unsurpassed complete and perfect awakening, the highest perfect buddhahood, he sent a messenger with the words ‘I request that he come into my presence, for I wish to make an offering.’

source: དེ་ནས་ཕོ་ཉ་དེས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལས་མཉན་ནས་རྒྱལ་པོ་གླིང་ལྡན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་ག་ལ་བ་དང་། རྒྱལ་པོ་གླིང་ལྡན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཕྲིན་དེ་སྐད་སྨྲས་སོ། །
en: “When that messenger heard from King Ajātaśatru, he traveled to the royal palace of King Endowed with Islands and then to King Endowed with Islands himself, and there, he relayed the message.
